Revit 2027 API
RebarCrankOverridableParameters Class
 Class used to store the formula parameter ids defined in the RebarShape family which are associated with crank length, crank offset length, crank straight length and crank angled length parameters.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.RebarCrankOverridableParameters
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class RebarCrankOverridableParameters : IDisposable
Public Class RebarCrankOverridableParameters
	Implements IDisposable
public ref class RebarCrankOverridableParameters : IDisposable
type RebarCrankOverridableParameters =
    class
        interface IDisposable
    end
The RebarCrankOverridableParameters type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the RebarCrankOverridableParameters
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetCrankEndAngledLengthFormulaParams |  Gets the formula parameter ids defined in the RebarShape family which are associated with end crank angled length parameters.
GetCrankEndLengthFormulaParams |  Gets the formula parameter ids defined in the RebarShape family which are associated with end crank length parameters.
GetCrankEndOffsetLengthFormulaParams |  Gets the formula parameter ids defined in the RebarShape family which are associated with end crank offset length parameters.
GetCrankEndRatioFormulaParams |  Gets the formula parameter ids defined in the RebarShape family which are associated with end crank ratio parameters.
GetCrankEndStraightLengthFormulaParams |  Gets the formula parameter ids defined in the RebarShape family which are associated with end crank straight length parameters.
GetCrankStartAngledLengthFormulaParams |  Gets the formula parameter ids defined in the RebarShape family which are associated with start crank angled length parameters.
GetCrankStartLengthFormulaParams |  Gets the formula parameter ids defined in the RebarShape family which are associated with start crank length parameters.
GetCrankStartOffsetLengthFormulaParams |  Gets the formula parameter ids defined in the RebarShape family which are associated with start crank offset length parameters.
GetCrankStartRatioFormulaParams |  Gets the formula parameter ids defined in the RebarShape family which are associated with start crank ratio parameters.
GetCrankStartStraightLengthFormulaParams |  Gets the formula parameter ids defined in the RebarShape family which are associated with start crank straight length parameters.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.DB.Structure Namespace